/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (ще +%2$d)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Не вдалося розпакувати «%1$@» з архіва «%2$@»: %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Не вдалося розпакувати ресурсну гілку файла «%1$@» з архіва «%2$@»:\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Стандартне кодування";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Виявляти автоматично";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Розпакувати";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Розпакувати архів";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Розпаковую «%@»";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Підготовка до розпакування «%@»";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Вибрати";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Виберіть файли для розпакування";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "Вміст «%@» не може бути розпаковано за допомогою The Unarchiver.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Сталася помилка при спробі розпакування вмісту «%1$@»: %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Сталася помилка при спробі читання вмісту «%1$@»: %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Розпакувати";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Будь ласка, надайте пароль для розпакування «%@».";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Куди The Unarchiver слід розпаковувати ваші архіви?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Завжди розпаковуйте в ту саму папку, або змусьте програму уточнювати місце розпакування кожного разу.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Питати щоразу";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Розпаковувати сюди ж";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver потребує вашого дозволу на збереження розпакованих файлів у вказаній папці. Натисніть «Розпакувати», щоб дозволити.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver потребує вашого дозволу на пошук інших частин архіва у вказаній папці. Натисніть «Пошук», щоб дозволити.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Пошук";

/* Check for updates menu item */
"Check for Updates…" = "Перевірити на оновлення…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Файл архіва неповний";
"Opening file failed" = "Не вдалося відкрити файл";
"Missing or wrong password" = "Зазначений пароль хибний";
"Wrong checksum" = "Пошкоджено файл архіва";
"Could not create directory" = "Не вдалося створити папку";

/* Uncommon or unused errors */
"Unknown error" = "Невідома помилка";
"Failed to write to file" = "Не вдалося записати до файлу";
"Function called with illegal parameters" = "Функцію викликано з хибними параметрами";
"Not enough memory available" = "Недостатньо пам'яті";
"Data is corrupted" = "Дані пошкоджено";
"File is not fully supported" = "Файл підтримується лише частково";
"Required resource missing" = "Відсутній потрібний ресурс";
"Error on decrunching" = "Помилка розпакування";
"Unknown file type" = "Навідомий формат файла";
"File, disk has been skipped" = "Файл, диск було пропущено";
"User cancelled extraction" = "Користувач скасував розпакування";
"File already exists" = "Файл вже існує";
"Verify failed (disk hook)" = "Помилка перевірки (disk hook)";
"Wrong drive geometry" = "Пошкоджена геометрія диска";
"Unknown data format" = "Невідомий формат даних";
"Source contains no files" = "Джерело не містить файлів";
"Unknown filesystem" = "Невідома файлова система";
"Name of file exists as directory" = "Ім'я файла співпадає з іменем існуючої папки";
"Buffer was too short" = "Замалий буфер пам'яті";
"Text encoding was defective" = "Кодування тексту пошкоджено";
"Could not create symlink" = "Не вдалося створити символічне посилання";

"AlertTitle_SetFileTypeAssociationAppStore" = "Призначте The Unarchiver стандартною програмою для вибраних типів файлів.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Перейдіть у «Досьє» з контекстного меню файла та виберіть The Unarchiver зі списку «Відкривати програмою:». Натисніть «Застосувати до всіх...», щоб програма відкривала всі файли такого формату.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "За бажанням, призначте іншу стандартну програму для вибраних типів файлів.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Перейдіть у «Досьє» з контекстного меню файла та виберіть бажану програму зі списку «Відкривати програмою:». Натисніть «Застосувати до всіх...», щоб програма відкривала всі файли такого формату.";

/* About window */
"Standalone" = "Окрема";

/* Extracted view */
"extracted" = "розпаковано";
